[
   {
      "01BlondMcMullen.pdf": {
         "DOI": "10.1016/s0732-0671(01)80034-1",
         "Title": "Developing Strategic Thinking in Welfare-To-Work Recipients",
         "Author": [
            "Kara Blond",
            "Page McCullen",
            "Nicole Reynolds"
         ],
         "Abstract": null
      }
   },
   {
      "01BudAlbrechtNicholsonZuckerman a.grobid.tei.xml": {
         "DOI": "10.1016/0375-9601(93)90827-m",
         "Title": "Information-Theoretic Advisors in Invisible Chess",
         "Author": [
            "A Bud",
            "D Albrecht",
            "A Nicholson",
            "I Zukerman"
         ],
         "Abstract": "Making decisions under uncertainty remains a central problem in AI research. Unfortunately, most uncertain real-world problems are so complex that progress in them is extremely difficult. Games model some elements of the real world, and offer a more controlled environment for exploring methods for dealing with uncertainty. Chess and chesslike games have long been used as a strategically complex test-bed for general AI research, and we extend that tradition by introducing an imperfect information variant of chess with some useful properties such as the ability to scale the amount of uncertainty in the game. We discuss the complexity of this game which we call invisible chess, and present results outlining the basic game. We motivate and describe the implementation and application of two information-theoretic advisors, and describe our decision-theoretic approach to combining these information-theoretic advisors with a basic strategic advisor. Finally we discuss promising preliminary results that we have obtained with these advisors."
      }
   },
   {
      "01Calvo.grobid.tei.xml": {
         "DOI": "10.1177/0002764215613406",
         "Title": "The Oldest Chess Pieces in Europe",
         "Author": [
            "Ricardo Calvo"
         ],
         "Abstract": null
      }
   },
   {
      "01DaileyLeiserson.pdf": {
         "DOI": "10.1016/j.entcom.2013.10.002",
         "Title": "Using Cilk to Write Multiprocessor Chess Programs",
         "Author": [
            "Don Dailey",
            "Charles Leiserson"
         ],
         "Abstract": null
      }
   },
   {
      "01HamiltonMilerOtt.grobid.tei.xml": {
         "DOI": "10.21236/ada300210",
         "Title": "Challenges in Applying Game Theory to the Domain of Information Warfare †",
         "Author": [
            "Samuel Hamilton",
            "Wendy Miller",
            "Allen Ott",
            "O Sami Saydjari"
         ],
         "Abstract": "There are significant advantages to utilizing game theory in the domain of information warfare. The algorithms sculpted to create programs capable of beating some of the best humans in the world in games such as chess and backgammon provide the ability to analyze millions of possibilities, model opponent characteristics, and selfgenerate what-if scenarios. Unfortunately, the difference between the domain of information warfare and traditional game domains make application of some of these techniques challenging. In this paper, we identify the major challenges presented by the domain of information warfare, and how these challenges interact with traditional game theoretic techniques."
      }
   },
   {
      "01JacobFaulhaber.grobid.tei.xml": {
         "DOI": "10.1524/auto.1985.33.112.325b",
         "Title": "Erklärungsmodell für Schachexpertise",
         "Author": [
            "Verena Jakob",
            "Jörg Faulhaber"
         ],
         "Abstract": null
      }
   },
   {
      "01Jeays.pdf": {
         "DOI": "10.1093/acprof:oso/9780195333169.003.0002",
         "Title": "A brief survey of psychological studies of chess",
         "Author": [
            "Mark Jeays"
         ],
         "Abstract": "A brief survey of psychological studies of chess I wrote this as a 3rd year term paper for my Human Information Processing class. The paper is presented in its original form although I may make odd minor corrections from time to time. Chess is an ancient game of skill. It is one of the few such popular games that is devoid of luck. As a result, it has been a popular choice of topic for psychological research, as it provides psychologists with insights into how humans think about problems. Chess has also been a very popular choice for artificial intelligence implentations, and the results have been very successful. For the first time last year, a computer program beat the world champion in a game with regulation time controls. The main question in psychological studies of chess is the following: how are better players able to win more often? Several factors have been investigated but there are no certain physiological advantages that always lead to better chess-playing. The most common finding of studies is that experience plays a great part in determining one's ability, which is certainly a promising thought for mediocre players. In essence, no chess gene has been found. This paper will provide an overview of psychological research into chess, with an emphasis on theories that have been proven inaccurate by future research, to show the development o research in this field. As with any other branch of psychology, theories are made, and then refined when conflicting experimental evidence becomes available."
      }
   },
   {
      "01Koenig.pdf": {
         "DOI": "10.1016/b978-0-12-372512-7.00011-0",
         "Title": "Agent-Centered Search",
         "Author": [
            "Sven Koenig"
         ],
         "Abstract": null
      }
   },
   {
      "01Mattlage.pdf": {
         "DOI": "10.1097/tp.0000000000001574",
         "Title": "An Essay On Circular Chess. A Modest Proposal",
         "Author": [
            "Alan Mattlage"
         ],
         "Abstract": "A Modest Proposal by Alan Mattlage Modifying Chess strikes most advanced Chess players as about as worthwhile as modifying the Mona Lisa. Why tamper with genius? Nonetheless, below is an outline of a new version of Chess which may prove to be more than a curiosity."
      }
   },
   {
      "01Melnikov.grobid.tei.xml": {
         "DOI": "10.1007/bf02832307",
         "Title": "Heuristics in Programming of Nondeterministic Games",
         "Author": [
            "B Melnikov"
         ],
         "Abstract": "In the paper, an approach to programming of nondeterministic antagonistic games is considered. This approach may be viewed as a generalization of the classical approach used for deterministic games (chess and the like) and is alternative to neural network methods of programming, which are usually applied to nondeterministic games. As examples of nondeterministic games, the very simple game omega and classical backgammon are considered. Results of programming these games are briefly discussed."
      }
   },
   {
      "01Muller.grobid.tei.xml": {
         "DOI": "10.1016/s0004-3702(01)00085-6",
         "Title": "Global and local game tree search",
         "Author": [
            "Martin Uller"
         ],
         "Abstract": "Computer programs based on minimax search have achieved great success, solving a number of classic games including Gomoku and Nine Men's Morris, and reaching a performance that approaches or surpasses the best human players in other well-known games such as checkers, Othello and chess. All these high-performance game-playing programs use global search methods, which evaluate complete game positions. Local search is an alternative approach that works well in the case where a game state can be partitioned into independent subgames. The method of decomposition search [M. M uller, in: IJCAI-99, 1999, p. 578] can solve such games by a combination of local combinatorial game search with evaluation techniques from combinatorial game theory. We compare local and global search in endgame problems in the game of Go, which has been traditionally regarded as beyond the range of exact search-based solution methods. An endgame solver based on decomposition search can solve problems with solution lengths exceeding 60 moves."
      }
   },
   {
      "01Saariluoma.grobid.tei.xml": {
         "DOI": "10.1007/978-3-662-07811-2_8",
         "Title": "Chess and content-oriented psychology of thinking",
         "Author": [
            "Pertti Saariluoma"
         ],
         "Abstract": "In this paper a number of principles for content-oriented cognitive psychology will be presented in the context of research into chess players' information processing. It will be argued that modern theoretical concepts of attention, imagery and memory are based on underlying concepts of capacity and format and that these concepts are not sufficiently powerful to express all phenomena associated with mental contents. Instead, one must develop a genuinely content-oriented theoretical language to discuss, for example, contents and their integration into thinking. The main problem is how to explain the contents of representations. Why do representations have precisely the contents that they have. Here the main attention will be focussed on the question how can one explain the selection of content elements in representations. To formulate the basic concepts of contentoriented thought research several issues must be discussed. Firstly, it will be shown that traditional attention and memory research is capacity-oriented and therefore unable to express mental contents. Secondly, it will be argued that there are content phenomena which must be explained by properties of other content phenomena. Thirdly, it will be shown that in chess, people integrate information into representations by using functional rules or reasons, i.e. concepts and rules, which tell why some information contents must be included in a representation. It will then be shown that people integrate information around learned 'thought models' whose contents, together with functional rules or reasons, explain and clarify the contentstructure of a mental representation. It will also be argued that the analysis of contents is metascientifically closer to linguistics with its basic method of explication and content analysis than natural sciences, which form the most common underlying model in current experimental psychology. Finally, content-oriented cognitive psychology and its presuppositions will be compared with neural and computational approaches to show that it gives an additional and alternative theoretical resource, but not a contradictory conceptual platform, to the previous theoretical ways of working with human thinking."
      }
   }
]