[
   {
      "00Aburaya.pdf": {
         "DOI": null,
         "Title": "Evolution von GPAgenten mit Schachwissen sowie deren Integration in ein Computerscachsystem",
         "Author": [
            "Hassan Aburaya"
         ],
         "Abstract": "1 Mit dem RoboCup beschäftigte sich auch die Projektgruppe 340: \" Fußball spielende kooperative Multiagentensysteme\". 2 Entspricht den auf \" Versuch und Irrtum\" ausgelegten Suchvorgängen der Evol. Algorithmen. 3 Entspricht den menschlichen Gehirnstrukturen nachempfundenen Neuronalen",
         "Introduction": null
      }
   },
   {
      "00AlissandrakisNehanivDeutenhan.grobid.tei.xml": {
         "DOI": null,
         "Title": "Learning How to Do Things with Imitation",
         "Author": [
            "Aris Alissandrakis",
            "Chrystopher Nehaniv",
            "Kerstin Dautenhahn"
         ],
         "Abstract": "In this paper we discuss how agents can learn to do things b imitating other agents. Especially we look at how the use o different metrics and sub-goal granularity can affect the imitation results. We use a computer model of a chess world as a test-bed to also illustrate issues that arise when there is dissimilar embodiment between the demonstrator and the imitator agents.",
         "Introduction": "Imitation is one of the most important mechanisms whereby knowledge may be transferred and skills acquired between agents (both biological and artificial). It requires two or more agents sharing a context that allows one agent to imitate another. Imitation involves reproducing observed actions and/or effects in an appropriate context. A comprehensive treatment of imitation needs to examin the actions, effects, context and goals of the participating agents. An interdisciplinary framework treating imitation formally is presented in "
      }
   },
   {
      "00BaenaBelmonteMandow.grobid.tei.xml": {
         "DOI": "10.1007/3-540-44595-1_3",
         "Title": "An Intelligent Tutor for a Web-Based Chess Course",
         "Author": [
            "Antonio Baena",
            "María-Victoria Belmonte",
            "Lawrence Mandow",
            "Dpto Lenguajes"
         ],
         "Abstract": "Web-based intelligent tutoring systems try to fill the gap between human teachers and printed textbooks as distance learning aids. Actually, intelligent tutoring systems research is concerned with the development of computer tools that show adaptive capabilities in the domain of tutoring, where the student's progress is autonomously monitored and guided according to some tutoring strategy. This paper provides details on the analysis, design and implementation of such a system. STIA (Sistema Tutor en Internet de Ajedrez) is a fully implemented Web-based tool developed to provide adaptive guidance and help while learning chess basics. In STIA the task of the tutor is to guide the student efficiently through the course material, according to the tutoring strategy defined by the course authors. This is achieved in two ways. First, it imposes limits on the portion of course material the students can access. This prevents them from getting lost in a flood of information. Second, the tutor evaluates each student's knowledge through a set of problems, and according to result recommends reviewing theory, solving more problems or advancing through the course.",
         "Introduction": "Courses are a common way to organize teaching at a high level. For each course and context, teachers decide what concepts will be taught, at what depth, and in what order, devise or select detailed examples for those concepts that are expected to raise more questions, and prepare an evaluation scheme to monitor the students' progress and understanding. In new courses most decisions can be based on the teacher's previous understanding of the course contents. Otherwise, these are frequently motivated by the teacher's previous experience in classrooms. In any case, they are certainly open to changes and improvements during the course itself."
      }
   },
   {
      "00Bailey.grobid.tei.xml": {
         "DOI": null,
         "Title": "Figure 13",
         "Author": [
            "Jacques Villon",
            "La Partie",
            "Marcel Duchamp",
            "Queen Surrounded",
            "N Adagp",
            "Paris Duchamp"
         ],
         "Abstract": null,
         "Introduction": null
      }
   },
   {
      "00Banaschak.pdf": {
         "DOI": null,
         "Title": "On the history of Chu Shogi",
         "Author": [
            "Peter Banaschak"
         ],
         "Abstract": null,
         "Introduction": null
      }
   },
   {
      "00BaxterTridgellWeaver b.grobid.tei.xml": {
         "DOI": "10.3233/icg-1998-21203",
         "Title": "Learning To Play Chess Using Temporal Differences",
         "Author": [
            "Jonathan Baxter",
            "Andrew Tridgell"
         ],
         "Abstract": "In this paper we present TDLEAF( ), a variation on the TD( ) algorithm that enables it to be used in conjunction with game-tree search. We present some experiments in which our chess program \"KnightCap\" used TDLEAF( ) to learn its evaluation function while playing on Internet chess servers. The main success we report is that KnightCap improved from a 1650 rating to a 2150 rating in just 308 games and 3 days of play. As a reference, a rating of 1650 corresponds to about level B human play (on a scale from E (1000) to A (1800)), while 2150 is human master level. We discuss some of the reasons for this success, principle among them being the use of on-line, rather than self-play. We also investigate whether TDLEAF( ) can yield better results in the domain of backgammon, where TD( ) has previously yielded striking success.",
         "Introduction": "Temporal Difference learning, first introduced by Samuel "
      }
   },
   {
      "00BaxterTridgellWeaver.grobid.tei.xml": {
         "DOI": null,
         "Title": "Learning to Play Chess Using Temporal Differences",
         "Author": [
            "Jonathan Baxter",
            "Sridhar Mahadevan"
         ],
         "Abstract": "In this paper we present TDLEAF(λ), a variation on the TD(λ) algorithm that enables it to be used in conjunction with game-tree search. We present some experiments in which our chess program \"KnightCap\" used TDLEAF(λ) to learn its evaluation function while playing on Internet chess servers. The main success we report is that KnightCap improved from a 1650 rating to a 2150 rating in just 308 games and 3 days of play. As a reference, a rating of 1650 corresponds to about level B human play (on a scale from E (1000) to A (1800)), while 2150 is human master level. We discuss some of the reasons for this success, principle among them being the use of on-line, rather than self-play. We also investigate whether TDLEAF(λ) can yield better results in the domain of backgammon, where TD(λ) has previously yielded striking success.",
         "Introduction": "Temporal Difference learning, first introduced by Samuel "
      }
   },
   {
      "00BealSmith.grobid.tei.xml": {
         "DOI": "10.1016/s0020-0255(99)00093-6",
         "Title": "Temporal dierence learning for heuristic search and game playing",
         "Author": [
            "D Beal",
            "M Smith"
         ],
         "Abstract": "Temporal dierence (TD) learning is a natural method of reinforcement learning that is particularly appropriate for learning in heuristic search and game playing. Sutton [Machine Learning 3 (1988)  9±44] introduced the TD(k) method which is an elegant integration of supervised learning with TD learning. TD(k) enabled TesauroÕs backgammon program to reach world championship standard. But it can be slow. TesauroÕs program was trained on 1 500 000 games. Recent work [D.F. Beal, M.C. Smith, Temporal coherence and prediction decay in temporal dierence learning. Technical Report no. 756, Department of Computer Science, Queen Mary and West®eld College, University of London, 1998] has described a signi®cant algorithmic improvement (temporal coherence) that controls learning rates, and produces more stable ®nal values. Results from a random walk task, and two complex real-world games are presented here to show that temporal coherence (TC) produces faster learning than earlier methods, and that TD learning can produce values that are superior to standard values for speci®ed search regimes, without any domain-speci®c information or human assistance. In the chess domain, we also describe the emergence of classic human elementary knowledge in the pattern of weights learnt from self-play, starting with weights initialised to zero.",
         "Introduction": "Central to all heuristic search, whether single-agent or adversarial, is an evaluation function. This estimates the distance to goal in single-agent searches, or the value of a game-state in competitive (zero-sum) tasks. The function is typically a polynomial, or weighted sum of evaluation terms"
      }
   },
   {
      "00BeydounHoffman.grobid.tei.xml": {
         "DOI": "10.1006/ijhc.1999.0338",
         "Title": "Incremental acquisition of search knowledge",
         "Author": [
            "Ghassan Beydoun",
            "Achim Hoffmann"
         ],
         "Abstract": "Expert systems by de\"nition address a particular domain; arguably this focus on particular domains is a lesson from the 1960s where the early enthusiasm for creating arti,cial intelligence (e.g. natural language understanding) was hampered by the realization that the context of understanding is extremely varying and intractable.",
         "Introduction": "In its early days, arti\"cial intelligence (AI) had a strong emphasis on search methods. The perception was that clever search techniques would account for most intelligent activities. In the early 1970s, researchers realized that in many cases it is not search which warrants the solution but rather knowledge about tasks and problems "
      }
   },
   {
      "00BjornssonMarsland.grobid.tei.xml": {
         "DOI": "10.1016/s0020-0255(99)00097-3",
         "Title": "Risk management in game-tree pruning",
         "Author": [
            "Y Bj Ornsson",
            "T Marsland"
         ],
         "Abstract": "In the half century since minimax was ®rst suggested as a strategy for adversary game search, various search algorithms have been developed. The standard approach has been to use improvements to the Alpha±Beta (a±b) algorithm. Some of the more powerful improvements examine continuations beyond the nominal search depth if they are of special interest, while others terminate the search early. The latter case is referred to as forward pruning.",
         "Introduction": "The standard approach to game-tree search is to use improvements to the Alpha±Beta (a±b) algorithm to explore all combination of moves to some ®xed depth (continuation length or search horizon). In practice, however, the algorithms are not used that way, instead heuristics vary the distance to the search horizon, exploring some variations more deeply than others. In an indirect way, this resembles the human thinking process. Continuations that are thought to be of special interest are expanded beyond the nominal depth, while Information Sciences 122 (2000) 23±41 www.elsevier.com/locate/ins others are terminated prematurely. The latter case is referred to as forward pruning."
      }
   },
   {
      "00Brockington.grobid.tei.xml": {
         "DOI": null,
         "Title": "0 Reimplementing A* 4.3 The History of Heuristic",
         "Author": [
            "Mark Brockington"
         ],
         "Abstract": "How much does adding a transposition table to IDA* save us? Experiments have shown that a transposition table can reduce the size of standard 15-puzzle searches by nearly 50% [Reinefeld 1994b], with the cost of storage and access being O(1), in comparison to O(log n) searches on a data structure for a CLOSED list that doesn't lose information.",
         "Introduction": "Most of you with Computer Science training have probably been through the typical Artificial Intelligence lecture on search and planning. You are shown A*, with some trivial example (so your professor doesn't get lost while doing it) which shows all of the various parts of A*. You've also sat through the proof of why A* generates an optimal solution when it has an admissible heuristic. If you're really lucky, you get to implement A* in Lisp or Prolog in an assignment, and solve a puzzle involving sliding tiles."
      }
   },
   {
      "00BrockingtonSchaeffer.grobid.tei.xml": {
         "DOI": "10.1006/jpdc.1999.1600",
         "Title": "APHID: Asynchronous Parallel Game-Tree Search",
         "Author": [
            "Mark Brockington",
            "Jonathan Schaeffer"
         ],
         "Abstract": "Most parallel game-tree search approaches use synchronous methods, where the work is concentrated within a specific part of the tree or at a given search depth. This article shows that asynchronous game-tree search algorithms can be as efficient as or better than synchronous methods in determining the minimax value.",
         "Introduction": "Making computers play games in a skillful manner, comparable to that of a strong human player, is a challenging problem that has attracted the attention of many computer scientists over the past 50 years. Two-player zero-sum games with perfect information, such as chess, Othello, 1 and checkers, are programmed using the same basic techniques. The :; algorithm "
      }
   },
   {
      "00Brudno.pdf": {
         "DOI": "10.1109/mc.2017.177",
         "Title": "Competitions, Controversies, and Computer Chess",
         "Author": [
            "Michael Brudno"
         ],
         "Abstract": null,
         "Introduction": null
      }
   },
   {
      "00Cowan.grobid.tei.xml": {
         "DOI": "10.1017/s0140525x01003922",
         "Title": "The magical number 4 in short-term memory: A reconsideration of mental storage capacity",
         "Author": [
            "Nelson Cowan",
            "S Avons",
            "Geoff Ward",
            "Riccardo Russo",
            "Graeme Halford",
            "Steven Phillips",
            "William Wilson",
            "Paul Muter",
            "James Nairne",
            "Ian Neath",
            "Emmanuel Pothos",
            "Patrick Juola",
            "Hannu Tiitinen",
            "Marius Usher",
            "Jonathan Cohen",
            "Henk Haarmann",
            "David Horn"
         ],
         "Abstract": "summarized evidence that people can remember about seven chunks in short-term memory (STM) tasks. However, that number was meant more as a rough estimate and a rhetorical device than as a real capacity limit. Others have since suggested that there is a more precise capacity limit, but that it is only three to five chunks. The present target article brings together a wide variety of data on capacity limits suggesting that the smaller capacity limit is real. Capacity limits will be useful in analyses of information processing only if the boundary conditions for observing them can be carefully described. Four basic conditions in which chunks can be identified and capacity limits can accordingly be observed are: (1) when information overload limits chunks to individual stimulus items, (2) when other steps are taken specifically to block the recoding of stimulus items into larger chunks, (3) in performance discontinuities caused by the capacity limit, and (4) in various indirect effects of the capacity limit. Under these conditions, rehearsal and long-term memory cannot be used to combine stimulus items into chunks of an unknown size; nor can storage mechanisms that are not capacitylimited, such as sensory memory, allow the capacity-limited storage mechanism to be refilled during recall. A single, central capacity limit averaging about four chunks is implicated along with other, noncapacity-limited sources. The pure STM capacity limit expressed in chunks is distinguished from compound STM limits obtained when the number of separately held chunks is unclear. Reasons why pure capacity estimates fall within a narrow range are discussed and a capacity limit for the focus of attention is proposed.",
         "Introduction": "One of the central contributions of cognitive psychology has been to explore limitations in the human capacity to store and process information. Although the distinction between a limited-capacity primary memory and an unlimitedcapacity secondary memory was described by James (1890), "
      }
   },
   {
      "00Dauvergne.grobid.tei.xml": {
         "DOI": null,
         "Title": "The Case for Chess as a Tool to Develop Our Children's Minds",
         "Author": [
            "Peter Dauvergne"
         ],
         "Abstract": "This article surveys educational and psychological studies to examine the benefits for children of studying and playing chess. These show that chess can",
         "Introduction": null
      }
   },
   {
      "00Davidson Opponent modeling in Poker.pdf": {
         "DOI": null,
         "Title": null,
         "Author": [],
         "Abstract": null,
         "Introduction": null
      }
   },
   {
      "00Elkies.grobid.tei.xml": {
         "DOI": null,
         "Title": "Higher Nimbers in pawn endgames on large chessboards",
         "Author": [
            "Noam Elkies"
         ],
         "Abstract": "We answer a question posed in [Elkies 1996] by constructing a class of pawn endgames on m×n boards that show the Nimbers * k for many large k. We do this by modifying and generalizing T.R. Dawson's \"pawns game\" [Berlekamp et al. 1982]. Our construction works for m ≥ 9 and n sufficiently large; on the basis of computational evidence we conjecture, but cannot yet prove, that the construction yields * k for all integers k.",
         "Introduction": "In "
      }
   },
   {
      "00EricssonKintschPatel.grobid.tei.xml": {
         "DOI": "10.1037//0033-295x.107.3.578",
         "Title": "How experts' adaptations to representative task demands account for the expertise effect in memory recall: Comment on Vicente and Wang (1998).",
         "Author": [
            "K Ericsson",
            "Vimla Patel",
            "Walter Kintsch"
         ],
         "Abstract": "s (1995) theoretical framework of long-term working memory (LTWM) accounts for how experts acquire encoding and retrieval mechanisms to adapt to real-time demands of working memory during representative interactions with their natural environments. The transfer of the same LTWM mechanisms is shown to account for the expertise effect in unrepresentative \"contrived\" memory tests. Therefore, K. J. Vicente and J. H. Wang's (1998) critique of the generalizability of the LTWM framework is rejected. Their proposed refutation of LTWM accounts is found to be based on misrepresented facts. The process-based framework of LTWM is shown to be superior to their product theory because it can explain interactions of the expertise effect in \"contrived\" recall under several testing conditions differing in presentation rate, instructions, and memory procedures.",
         "Introduction": null
      }
   },
   {
      "00Everhart a.grobid.tei.xml": {
         "DOI": "10.1006/game.1999.0763",
         "Title": "Chess-like Games are Dominance Solvable in at Most Two Steps",
         "Author": [
            "Christian Ewerhart"
         ],
         "Abstract": "We show that strictly competitive, …nite games of perfect information that may end in one of three possible ways can be solved by applying only two rounds of elimination of dominated strategies.",
         "Introduction": "In probably the …rst contribution to pure game theory at all, "
      }
   },
   {
      "00Everhart b.grobid.tei.xml": {
         "DOI": "10.1006/game.2001.0900",
         "Title": "Backward induction and the game-theoretic analysis of chess",
         "Author": [
            "Christian Ewerhart",
            "Stephen Andrews",
            "Dieter Balkenborg",
            "Martin Dufwenberg",
            "Ehud Kalai",
            "Martin Osborne",
            "Jörn Rothe",
            "Ulrich Schwalbe",
            "Bernhard Von Stengel"
         ],
         "Abstract": "The paper scrutinizes various stylized facts related to the minmax theorem for chess. We first point out that, in contrast to the prevalent understanding, chess is actually an infinite game, so that backward induction does not apply in the strict sense. Second, we recall the original argument for the minmax theorem of chess -which is forward rather than backward looking.",
         "Introduction": "The classic paper of "
      }
   },
   {
      "00Faulhammer.grobid.tei.xml": {
         "DOI": "10.1073/pnas.97.4.1385",
         "Title": "Molecular computation: RNA solutions to chess problems",
         "Author": [
            "Dirk Faulhammer",
            "Anthony Cukras",
            "Richard Lipton",
            "Laura Landweber",
            "Chi-Chih Andrew"
         ],
         "Abstract": null,
         "Introduction": null
      }
   },
   {
      "00Furnkranz.grobid.tei.xml": {
         "DOI": "10.1007/978-0-387-30164-8_504",
         "Title": "Machine Learning in Games: A Survey",
         "Author": [
            "Johannes Fürnkranz"
         ],
         "Abstract": "This paper provides a survey of previously published work on machine learning in game playing. The material is organized around a variety of problems that typically arise in game playing and that can be solved with machine learning methods. This approach, we believe, allows both, researchers in game playing to find appropriate learning techniques for helping to solve their problems as well as machine learning researchers to identify rewarding topics for further research in game-playing domains. The paper covers learning techniques that range from neural networks to decision tree learning in games that range from poker to chess. However, space constraints prevent us from giving detailed introductions to the used learning techniques or games. Overall, we aimed at striking a fair balance between being exhaustive and being exhausting.",
         "Introduction": null
      }
   },
   {
      "00GainesBerkovitzKohn.grobid.tei.xml": {
         "DOI": null,
         "Title": "CHESS AS A WAY OF IMPROVING OBJECT RELATIONSHIPS IN NARCISSISTIC TEENAGERS",
         "Author": [
            "Larry Gaines",
            "Irving Berkovitz",
            "Ben Kohn"
         ],
         "Abstract": "As with many interesting discoveries, the realization that chess can be used to improve object relationships with narcissistic adolescents came about serendipitously. The principal author 1 was counseling a 17-yearold boy of Russian/Armenian descent using traditional talk therapy. An exploration of the boy's family relationships revealed his perception of his mother and father as controlling and domineering-\"they're from the Old World,\" as he described it. His heritage led to a discussion of Kasparov and other chess masters he could idealize (he took pride in his cultural identification). Sharing an interest in chess led to a \"challenge\" match, which was observed by the boy's fellow alternative education students. Chess became an immediate catalyst to students seeking a relationship with me, and the use of the game served as a method and metaphor for working with the narcissistic issues affecting their interpersonal and school relationships.",
         "Introduction": null
      }
   },
   {
      "00George.grobid.tei.xml": {
         "DOI": null,
         "Title": "CHUNKING FOR EXPERIENCE",
         "Author": [
            "Michael George",
            "Jonathan Schaeffer"
         ],
         "Abstract": "Human game players rely heavily on the experience gained by playing over the games of masters. A player may recall a previous game to either obtain the best move (if he has previously seen the identical position) or suggest a best move (if similar to others seen). However, game-playing programs operate in isolation, relying on the combination of search and programmed knowledge to discover the best move, even in positions well-known to humans. At best, programs have only a limited amount of information about previous games. This paper discusses enhancing a chess-playing program to discover and extract implicit knowledge from previously played grandmaster games, and using it to improve the chess program's performance. During a game, a database of positions is queried looking for identical or similar positions to those on the board. Similarity measures are determined by chunking the position and using these patterns as indices into the database. Relevant information is subsequently passed back to the chess program and used in its decision making process. As the number of games in the database increases, the \"experience\" available to the program improves the likelihood that relevant, useful information can be found for a given position.",
         "Introduction": "For many subject areas requiring skills, a large body of previous experience is usually gathered which can be used as a resource to be studied for improving one's performance. Unfortunately, most attempts at having machines mimic human behavior are primarily concerned with trying to solve the problem in isolation (usually a difficult enough task), without exploiting the available wealth of others' experience. For many disciplines, this information is not available in machine readable form. Other than using simple memory tables, few programs attempt to take advantage of the acquired wealth of human experience on a particular subject."
      }
   },
   {
      "00Gobet a.grobid.tei.xml": {
         "DOI": null,
         "Title": "Long-Term Working Memory: A Computational Implementation for Chess Expertise",
         "Author": [
            "Fernand Gobet"
         ],
         "Abstract": "Long-term working memory ",
         "Introduction": null
      }
   },
   {
      "00Gobet b.grobid.tei.xml": {
         "DOI": null,
         "Title": "Theories of chess memory -1 -MEMORY IN CHESS PLAYERS: COMPARISON OF FOUR THEORIES",
         "Author": [
            "Fernand Gobet"
         ],
         "Abstract": "This paper compares four current theories of expert memory with respect to chess players' memory: Chase and Simon's (1973) chunking theory, theories stressing the role of conceptual knowledge and levels of encoding, Ericsson and Kintsch's (1995) long-term working memory, and Gobet and Simon's (in press-b) template theory. It is shown that the template theory outperforms its rivals in accounting for the empirical evidence. The theory, which unifies low-level aspects of cognition, such as chunks, with high-level aspects, such as schematic knowledge and planning, suggests that chunks are accessed through a discrimination net, and that they can evolve into more complex data structures (templates) specific to classes of positions.",
         "Introduction": null
      }
   },
   {
      "00Gobet.grobid.tei.xml": {
         "DOI": "10.1024//1421-0185.60.4.264",
         "Title": "Réseaux de discrimination en psychologie: L'exemple de CHREST",
         "Author": [
            "Fernand Gobet"
         ],
         "Abstract": "du Leverhulme Trust, et de l'Université de Nottingham. Ma gratitude va également aux membres du groupe CHREST qui ont contribué de manière importante à cette",
         "Introduction": null
      }
   },
   {
      "00GobetSimon.grobid.tei.xml": {
         "DOI": "10.1207/s15516709cog2404_4",
         "Title": "Five Seconds or Sixty? Presentation Time in Expert Memory",
         "Author": [
            "Fernand Gobet",
            "Herbert Simon"
         ],
         "Abstract": "For many years, the game of chess has provided an invaluable task environment for research on cognition, in particular on the differences between novices and experts and the learning that removes these differences, and upon the structure of human memory and its paramaters. The template theory presented by Gobet and Simon based on the EPAM theory offers precise predictions on cognitive processes during the presentation and recall of chess positions. This article describes the behavior of CHREST, a computer implementation of the template theory, in a memory task when the presentation time is varied from one second to sixty, on the recall of game and random positions, and compares the model to human data. Strong players are better than weak players in both types of positions, especially with long presentation times, but even after brief presentations. CHREST predicts the data, both qualitatively and quantitatively. Strong players' superiority with random positions is explained by the large number of chunks they hold in LTM. Their excellent recall with short presentation times is explained by templates, a special class of chunks. CHREST is compared to other theories of chess skill, which either cannot account for the superiority of Masters in random positions or predict too strong a performance of Masters in such positions.",
         "Introduction": "The study of expert behavior offers a unique window into human cognition. By looking at extreme performance, cognitive scientists determine what parameters of the human information processing system can change with extensive practice, what parameters are relatively stable, and what strategies can be used to overcome the limits imposed by these stable parameters. As experts must abide by the known limits of cognition, the information Direct all correspondence to: Herbert A. "
      }
   },
   {
      "00Greer.grobid.tei.xml": {
         "DOI": "10.1016/s0004-3702(00)00026-6",
         "Title": "Computer chess move-ordering schemes using move influence",
         "Author": [
            "Kieran Greer"
         ],
         "Abstract": "The chessmaps heuristic is a pattern-oriented approach to ordering moves for the game of chess. It uses a neural network to learn a relation between the control of the squares and the influence of a move. Depending on what squares a player controls, the chessmaps heuristic tries to determine where the important areas of the chessboard are. Moves that influence these important areas are then ordered first. The heuristic has been incorporated into a move-ordering algorithm that also takes account of immediate tactical threats. Human players also rely strongly on patterns when selecting moves, but would also consider immediate tactical threats, so this move-ordering algorithm is an attempt to mimic something of the human thought process when selecting a move. This paper presents a new definition for the influence of a move, which improves the performance of the heuristic. It also presents a new experience-based approach to determining what areas of the chessboard are important, which may actually be preferred to the chessmaps heuristic. The results from game-tree searches suggest that the move-ordering algorithm could compete with the current best alternative of using the history heuristic with capture moves in a brute-force search.",
         "Introduction": "This paper will present a move-ordering algorithm that attempts to mimic something of the human thought process when selecting chess moves. At the heart of this is a heuristic called the chessmaps heuristic, that orders moves depending on which areas of the chessboard they influence. The definition for the influence of a move is given in Section 2.3.  If a chessboard is divided into specific areas, which could be of any size or shape, then the term sector is used to define one of these areas and Figs. "
      }
   },
   {
      "00Grimbergen.pdf": {
         "DOI": "10.1007/3-540-45579-5_21",
         "Title": "Plausible Move Generation Using Move Merit Analysis with Cut-Off Thresholds in Shogi",
         "Author": [
            "Reijer Grimbergen"
         ],
         "Abstract": null,
         "Introduction": null
      }
   },
   {
      "00GrimbergenMatsubara.pdf": {
         "DOI": "10.1007/3-540-45579-5_21",
         "Title": "Plausible Move Generation Using Move Merit Analysis in Shogi",
         "Author": [
            "Reijer Grimbergen",
            "Hitoshi Matsubara"
         ],
         "Abstract": null,
         "Introduction": null
      }
   },
   {
      "00Groot.pdf": {
         "DOI": "10.1177/039219210004819003",
         "Title": "Roger Caillois, Games of Chance and the Superstar",
         "Author": [
            "Loek Groot"
         ],
         "Abstract": "Superstars are not by accident a conspicuous phenomenon in our culture, but inherently belong to a meritocratic society with mass media, free enterprise, and competition. To make this contention plausible I will use Caillois's book, Man, Play and Games, 1 to compare the mechanisms underlying the superstar phenomenon with a special kind of game, as set out by Caillois. As far as I know, Caillois's book is not quoted in the literature dealing with income distribution theories, although the comparison with play and games is, for limited purposes, interesting. In play and games we find almost all elements which play a role in theories of just income distribution: equality of opportunity, chance, talent, competition and skill, reward, entitlement, winners and losers, etc. These are not chance similarities, for \". . . games are largely dependent upon the cultures in which they are practised. They affect their preferences, prolong their customs, and reflect their beliefs . . . One . . . can . . . posit a truly reciprocal relationship between a society and the games it likes to play\". 2 Moreover, as we will see, superstars combine the four basic characteristics of play that make their activities a special kind of play.",
         "Introduction": null
      }
   },
   {
      "00GrunwaldLevisFarkas.grobid.tei.xml": {
         "DOI": "10.1109/tac.2013.2256682",
         "Title": "Policies for Dynamic Clock Scheduling",
         "Author": [
            "Dirk Grunwald",
            "Philip Levis",
            "Charles Morrey",
            "Michael Neufeld",
            "Keith Farkas"
         ],
         "Abstract": "Pocket computers are beginning to emerge that provide sufficient processing capability and memory capacity to run traditional desktop applications and operating systems on them. The increasing demand placed on these systems by software is competing against the continuing trend in the design of low-power microprocessors towards increasing the amount of computation per unit of energy. Consequently, in spite of advances in low-power circuit design, the microprocessor is likely to continue to account for a significant portion of the overall power consumption of pocket computers. This paper investigates clock scaling algorithms on the Itsy, an experimental pocket computer that runs a complete, functional multitasking operating system (a version of Linux 2.0.30). We implemented a number of clock scaling algorithms that are used to adjust the processor speed to reduce the power used by the processor. After testing these algorithms, we conclude that currently proposed algorithms consistently fail to achieve their goal of saving power while not causing user applications to change their interactive behavior.",
         "Introduction": "Dynamic clock frequency scaling and voltage scaling are two mechanisms that can reduce the power consumed by a computer. Both voltage scaling and frequency scaling are important; the power consumed by a component implemented in CMOS varies linearly with frequency and quadratically with voltage."
      }
   },
   {
      "00Gumbricht.grobid.tei.xml": {
         "DOI": "10.1093/oseo/instance.wiggins2130",
         "Title": "Modeling with GIS: A Game of Chess",
         "Author": [
            "Thomas Gumbricht",
            "Birger Jarlsgatan",
            "20 Stockholm"
         ],
         "Abstract": "Modeling processes in GIS is both a step forwards and a step backwards. The article analyses some of the shortcomings in GIS modeling using the game of chess as an analogue for spatial processes. A research agenda for improved dynamic modeling in GIS is concluded.",
         "Introduction": "The dichotomy between data focusing, static and two dimensional (2D) geographical information systems (GIS) on one side and dynamic, mathematical environmental models on the other have been discussed by several authors "
      }
   },
   {
      "00Haworth.grobid.tei.xml": {
         "DOI": null,
         "Title": "Deepest Chess Win Revisited",
         "Author": [
            "C Haworth"
         ],
         "Abstract": "Thompson's renewed contribution to the available suite of chess endgame tables (EGTs) is very welcome. A request for a KQQKQQ EGT (Nalimov, Wirth and Haworth, 1999)  apparently arrived coincidentally and just before production recommenced. Some 50 EGTs (Thompson, 1999)  dating from 26 th November, 1999 are now available.",
         "Introduction": null
      }
   },
   {
      "00Heinz a.pdf": {
         "DOI": "10.1007/3-540-45579-5_18",
         "Title": "A New Self-Play Experiment in Computer Chess",
         "Author": [
            "Ernst Heinz"
         ],
         "Abstract": "bj ¥' öl on kh ¤s j ¥' n © y6 ' 6 £t bj ml on b! $© 86 `n © s a A6 # 3# Ys &% ux WS e6 a c© t bj s eI p § \"! qs 6h Q § j 6 X# 3 § ' 06 h kt Yn © 8S 4t Va l Qa P6 # Ys q B9 's A! $ B § h kj t ¥C ) 0 `w Rh ¤s P# V6 `n ¤s A% Pn Q© s j G ¥S s 6h ¤l ¡ § )j 8 § G% s 6l 6 l ¯l os &6 £h ca c© s A% 5 7% {t 4",
         "Introduction": null
      }
   },
   {
      "00Heinz b.grobid.tei.xml": {
         "DOI": "10.3233/icg-2000-23104",
         "Title": "AEL PRUNING 1",
         "Author": [
            "Ernst Heinz"
         ],
         "Abstract": "In the past, we introduced the new forward-pruning techniques adaptive null-move pruning (A), extended futility pruning (E), and limited razoring (L). Since they differ substantially in nature, it remained unclear how well they combine and which level of effectiveness their combination achieves. Based on the names of the three building blocks, we call the combined scheme AEL pruning. As it turns out, AEL pruning clearly belongs to the collection of practically successful forward-pruning techniques in computer chess.",
         "Introduction": "Our recent articles "
      }
   },
   {
      "00Heinz c.grobid.tei.xml": {
         "DOI": null,
         "Title": "STATIC RECOGNITION OF POTENTIAL WINS IN KNNKB AND KNNKN",
         "Author": [
            "E Heinz"
         ],
         "Abstract": "The fact that the strong side cannot enforce a win in KNNK makes many chess players (both humans and computers) prematurely regard KNNKB and KNNKN to be trivially drawn too. This is not true, however, because there are several tricky mate themes in KNNKB and KNNKN which occur more frequently and require more complicated handling than common wisdom thinks. The text analyzes the mate themes and derives rules from them which allow for the static recognition of potential wins in KNNKB and KNNKN without further lookahead by search. Although endgame databases achieve the same goal, they are normally far less efficient at doing so because of their additional I/O and memory requirements (even when compressed).",
         "Introduction": "Usually, two bare Knights are not much of a force when it comes to mating in late endgames such as KNNK, KNNKB, and KNNKN. It is well-known that these endgames are generally drawn despite the substantial material advantage enjoyed by the strong side "
      }
   },
   {
      "00Hespanha.grobid.tei.xml": {
         "DOI": null,
         "Title": "Deception in Non-Cooperative Games with Partial Information †",
         "Author": [
            "João Hespanha",
            "Yusuf Ateşkan",
            "Hüseyin Kızılocak"
         ],
         "Abstract": "In this paper we explore how deception can be used by rational players in the context of non-cooperative stochastic games with partial information. We show that, when one of the players can manipulate the information available to its opponents, deception can be used to increase the player's payoff by effectively rendering the information available to its opponent useless. However, this is not always the case. Paradoxically, when the degree of possible manipulation is high, deception becomes useless against an intelligent opponent since it will simply ignore the information that has potentially been manipulated. This study is carried out for a prototype problem that arises in the control of military operations, but the ideas presented are useful in other areas of applications, such as price negotiation, multi-object auctioning, pursuit-evasion, etc.",
         "Introduction": "Competitive games are usually classified as either having full or partial information. In full-information games both players know the whole state of the game when they have to make decisions. By state, we mean all information that is needed to completely describe the future evolution of the game, when the decision rules used by both players are known. Examples of full information games include Chess, Checkers, and Go. Partial-information games differ from these in that at least one of the players does not know the whole state of the game. Poker, Bridge, and Hearts are examples of such games. In full information games, as a player is planning its next move, it only needs to hypothesize over its and the opponent's future moves to predict the possible outcomes of the game "
      }
   },
   {
      "00Hochberg.pdf": {
         "DOI": "10.1007/s12109-000-0008-6",
         "Title": "An Imperfect Visionary",
         "Author": [
            "Bust Hochberg"
         ],
         "Abstract": null,
         "Introduction": null
      }
   },
   {
      "00JansenDoweFarr Inductive inference of chess player strategy.pdf": {
         "DOI": "10.1007/3-540-44533-1_10",
         "Title": "Inductive Inference of Chess Player Strategy",
         "Author": [
            "Anthony Jansen",
            "David Dowe",
            "Graham Farr"
         ],
         "Abstract": "D ¡ ¢ £ 8¤ w¥ Y¢ i¦ ! § ¤f j kl Y{ f y ge uj kt Ym 8e gf ©e g wf ¢ wh g iŸ kf © o wj kl x rf h gh uj kl t wv i rh g i ªh gf h gn y 8 R P f y gy t Ym 8 !f y v y g !f «m 8y g Hf e gy D 8 ©e g wf %y ge gh Pm 8e gf t i| Ud y gf n ¬e g « x ~m | e g wf %t Ym 8 !f y ® dūl Yj ke uj ~m k| v t Ym 8 !f rh gf h gn y rm 8h gf rt if l wf h Pm oe gf n h g i ©y gf b ±°q Y ~m | DŸ| e up ¢ \"y uj k g x kf \" P f y gy ¢ h g t ih Pm 8 !y v il wf © 8 yp t Yj k P %n w Yf y rm © il wf b°q Y k| %y gf 8m 8h g b Dp r xj kf \"e g wf r ie g wf h ¢n w Yf y vm t r id wh u°q x k| D² Yd Yj kf y u° f l Ye y gf m oh g P ³® ūl f 8m o P 8m oy gf iv p ¢f rm 8h gf rm oŸ kf re g tj kl Y rf h v 8 rh g i ¬ǵd y ge ye g f rt µm o !f ¢h gf ih gn wy v t i Y Yn ¤f y ge uj k Dm 8e gf y o e g f !p f bj kt i Ye gy d y gf n 0j kl e g wf f { m kd xm oe uj k il rd wl e uj k l ³® y ¶ r f m o Y° wh g Ym o P !j ky }e g wf l m o w Y j kf n %e g \"t h Pm ol wn Dm 8y ge gf h rt Ym 8 !f y ® w• ©d wh } l f P°u Y k| m ol wn D² Yd xj kf y g f l Ye r d h u°q Y k| ¦ wh g it h Pm o !y ¸m oh gf «l w 8p 'n h Pm 8y ge uj k ¹y uj k ! Y j º x 8m oe uj ~ il wy ¹ 8 \"e g wf «e gh gd f «y ge gh Pm 8e gf t i| d wy gf n ³® ¼» t l f e g wf b kf y gy v Rd wy uj kl wt ½j kl Y rf h gh gf n «p ¢f Pj kt i Ye gy t ih re g f y gf \" Y| Y H ie g wf e uj k 8m ¢ ! Yn wf b ky v p ¢f Dm 8h gf Dy ge uj \"m 8ẍ kf e g «m 8 b Yj kf { if «y g !f Dy gd f y gy D¾ qm oy !f 8m oy gd wh gf n Ÿ| ¤ i ! wh gf y gy uj k l h Pm oe gf y ih re g f \"t µm o !f y P¿ j kl « wh gf n Yj k e uj kl wt %",
         "Introduction": null
      }
   },
   {
      "00Joyner.pdf": {
         "DOI": null,
         "Title": "Chess and MAPLE",
         "Author": [
            "D Joyner"
         ],
         "Abstract": null,
         "Introduction": null
      }
   },
   {
      "00Kraaijeveld.grobid.tei.xml": {
         "DOI": null,
         "Title": "Origin of chess -a phylogenetic perspective",
         "Author": [
            "Alex Kraaijeveld"
         ],
         "Abstract": null,
         "Introduction": null
      }
   },
   {
      "00KubatZizka.grobid.tei.xml": {
         "DOI": "10.1007/3-540-45049-1_52",
         "Title": "Learning Middle-Game Patterns in Chess: A Case Study",
         "Author": [
            "Miroslav Kubat",
            "Jan Žižka"
         ],
         "Abstract": "Despite the undisputed strength of today's chess-playing programs, the fact that they have to evaluate millions, or even billions, of different positions per move is unsatisfactory. The amount of \"computation\" carried out by human players is smaller by orders of magnitudes because they employ specific patterns that help them narrow the search tree. Similar approach should in principle be feasible also in computer programs. To draw attenion to this issue, we report our experiments with a program that learns to classify chessboard positions that permit the well-known bishop sacrifice at h7. We discuss some problems pertaining to the collection of training examples, their representation, and pre-classification. Classification accuracies achieved with a decision-tree based classifier are encouraging.",
         "Introduction": "Since Shannon's seminal paper "
      }
   },
   {
      "00KuffnerLatombe.grobid.tei.xml": {
         "DOI": "10.1109/pccga.2000.883973",
         "Title": "Interactive Manipulation Planning for Animated Characters",
         "Author": [
            "James Kuffner",
            "Jean-Claude Latombe"
         ],
         "Abstract": "We present a brief overview of an algorithm for interactively animating object grasping and manipulation tasks for human figures. The technique is designed to efficiently generate feasible single-arm manipulation motions given highlevel task commands. For moving an object, the motions necessary for a human arm to reach and grasp the object, reposition it, and return the arm to rest are generated automatically within a few seconds on average.",
         "Introduction": "Object manipulation is an important class of motions for interactive animated characters. Manipulation tasks can encompass a virtually unlimited combination of object and obstacle geometries. Thus, it seems unlikely that one would be able to successfully enumerate all possibilities and simply store thousands of pre-recorded motion sequences. Instead, a flexible strategy that can accommodate a wide range of situations is needed."
      }
   },
   {
      "00KuylenstiernaRydmark.grobid.tei.xml": {
         "DOI": "10.1016/0304-422x(91)90021-g",
         "Title": "The Value of Information in War: Some Experimental Findings",
         "Author": [
            "Jan Kuylenstierna",
            "Joacim Rydmark",
            "Tonie Fahraeus"
         ],
         "Abstract": "A common assumption is that what matters in combat outcome is information superiority 1 . The absolute level of uncertainty about the situation in the battlespace is seen as unimportant. Is that true? Results obtained with a dynamic, chessbased wargame indicate that the answer to this question is no -the absolute level of uncertainty is important. More specifically the results show that as the absolute level of uncertainty increases, the value of having information superiority as well as the value of having superior strength decreases, whereas the value of having tempo superiority remains unaffected. Two conclusions are drawn. The first is that information superiority may be best created at lower levels of command where uncertainty is at its lowest. The second is that because uncertainty probably will continue to be a problem in war, tempo superiority may be a more viable alternative than information superiority or superior strength for winning.",
         "Introduction": "Not even staunch believer in the potential of the new information technology believe that it will dissipate the \"fog of war\", and make command and control with perfect understanding of the battlespace possible."
      }
   },
   {
      "00Landis.grobid.tei.xml": {
         "DOI": "10.1007/bf03025307",
         "Title": "Remembering",
         "Author": [
            "A Kronrod",
            "E Landis",
            "I Yaglom",
            "Viola Brudno",
            "W Alter Gautschi",
            "Semenovich Aleksandr",
            "Alexander Eremenko"
         ],
         "Abstract": "Sasha Kronrod discovered mathematics when he was a participant in the now legendary study group for schoolchildren that was a liated with Moscow State University. His teacher, D.O.",
         "Introduction": null
      }
   },
   {
      "00Laramee.pdf": {
         "DOI": "10.1145/242224.242317",
         "Title": "Chess Programming",
         "Author": [
            "Francois Laramée"
         ],
         "Abstract": "0)24)*55$-4!+2503&')%!&2!0,*6!+#'%%7!*-8!16!'.&'-%$2-! 2&#')!%$5$,*)!%&)*&'46!4*5'%!2(!0')('+&!$-(2)5*&$2-9 :",
         "Introduction": null
      }
   },
   {
      "00Lassiter.grobid.tei.xml": {
         "DOI": null,
         "Title": "THE RELATIVE CONTRIBUTIONS OF RECOGNITION AND SEARCH-EVALUATION PROCESSES TO HIGH-LEVEL CHESS PERFORMANCE: Comment on Gobet and",
         "Author": [
            "Simon Lassiter",
            "G Lassiter"
         ],
         "Abstract": null,
         "Introduction": null
      }
   },
   {
      "00LewisVoidaMartin.grobid.tei.xml": {
         "DOI": null,
         "Title": "Visualizing Chess Games",
         "Author": [
            "Scott Lewis",
            "Stephen Voida",
            "Chris Martin"
         ],
         "Abstract": "Chess is a strategic game in which players recognize the threats to their pieces and their opponents' pieces at any given time. Players also evaluate the affect each move will have on the balance of power in the game. Novice players often fail to detect threatened pieces of either color. They also find prediction difficult and frequently neglect to think ahead about the negative ramifications of their moves. We have developed a chess visualization tool that helps novice players track the relative risk in which either their pieces or their opponentÕs pieces reside. The visualization tool also enables novice players to maintain a sense of the amount of influence each side has over empty squares. Advanced players may also find value in the chess visualization tool in evaluating and identifying the critical decisions made in grandmastersÕ games.",
         "Introduction": "Chess is a game in which every move irrevocably changes the future directions in which the game can move. What makes expert chess players exceptionally good is that they can compare and evaluate these potential outcomes to one another and choose the current move that will benefit them the most. Chess masters can easily evaluate board situations at a glace and begin concentrating on their future strategies."
      }
   },
   {
      "00LoddoDiCosmo.pdf": {
         "DOI": "10.1007/3-540-44404-1_14",
         "Title": "Playing Logic Programs with the Alpha-Beta Algorithm",
         "Author": [
            "JeanVincent Loddo",
            "Roberto DiCosmo"
         ],
         "Abstract": null,
         "Introduction": null
      }
   },
   {
      "00Lorenz.grobid.tei.xml": {
         "DOI": "10.1007/3-540-46541-3_39",
         "Title": "Controlled Conspiracy-2 Search (Extended Abstract)",
         "Author": [
            "Ulf Lorenz"
         ],
         "Abstract": "When playing board games like chess, checkers, othello etc., computers use game tree search algorithms to evaluate a position. The greatest success of game tree search so far, has been the victory of the chess machine 'Deep Blue' vs. G. Kasparov, the best human chess player in the world. When a game tree is too large to be examined exhaustively, the standard method for computers to play games is as follows. A partial game tree (envelope) is chosen for examination. This partial game tree may be any subtree of the complete game tree, rooted at the starting position. It is explored by the help of the αβ-algorithm, or any of its variants. All αβvariants have in common that a single faulty leaf evaluation may cause a wrong decision at the root. To overcome this insecurity, we propose Cc2s, a new algorithm, which selects an envelope in a way that the decision at the root is stable against a single faulty evaluation. At the same time, it examines this envelope efficiently. We describe the algorithm and analyze its time behavior and correctness. Moreover, we are presenting some experimental results from the domain of chess. Cc2s is used in the parallel chess program P.ConNerS, which won the",
         "Introduction": "Some games have been proven to be PSPACE-complete. As a consequence, we cannot do anything better than to examine a complete game tree when we want to find a perfect decision or if we want to know the value of the starting situation. For most of the interesting board games we do not know the correct values of all positions. Therefore, we are forced to base our decisions on heuristic or vague knowledge. An approximation is done by the following method."
      }
   },
   {
      "00Lotringer.grobid.tei.xml": {
         "DOI": null,
         "Title": "Becoming Duchamp",
         "Author": [
            "Sylvère Lotringer",
            "Marcel Duchamp"
         ],
         "Abstract": "They did not speak. They did not sing, they remained, all of them, silent, almost determinedly silent; but from",
         "Introduction": null
      }
   },
   {
      "00Luscher.grobid.tei.xml": {
         "DOI": "10.1145/800206.806373",
         "Title": "Automatic Generation of an Evaluation Function for Chess Endgames",
         "Author": [
            "Matthias Lüscher",
            "Thomas Lincke",
            "Christoph Wirth"
         ],
         "Abstract": null,
         "Introduction": null
      }
   },
   {
      "00Melnikov.grobid.tei.xml": {
         "DOI": "10.1007/bf02832307",
         "Title": "Heuristics in Programming of Nondeterministic Games",
         "Author": [
            "B Melnikov"
         ],
         "Abstract": "In the paper, an approach to programming of nondeterministic antagonistic games is considered. This approach may be viewed as a generalization of the classical approach used for deterministic games (chess and the like) and is alternative to neural network methods of programming, which are usually applied to nondeterministic games. As examples of nondeterministic games, the very simple game omega and classical backgammon are considered. Results of programming these games are briefly discussed.",
         "Introduction": "This paper may be viewed as a sequel of the work [1]. We consider certain heuristics applied by the author to programming games. "
      }
   },
   {
      "00Michie.pdf": {
         "DOI": null,
         "Title": "It takes two (at least) to tango",
         "Author": [
            "Donald Michie"
         ],
         "Abstract": null,
         "Introduction": null
      }
   },
   {
      "00Morales.grobid.tei.xml": {
         "DOI": "10.1007/978-3-642-05258-3_30",
         "Title": "Scaling Up Reinforcement Learning with a Relational Representation",
         "Author": [
            "Eduardo Morales"
         ],
         "Abstract": "Reinforcement learning has been repeatedly suggested as good candidate for learning in robotics. However, the large search spaces normally occurring robotics and expensive training experiences required by reinforcement learning algorithms has hampered its applicability. This paper introduces a new approach for reinforcement learning based on a relational representation which: (i) can be applied over large search spaces, (ii) can incorporate domain knowledge, and (iii) can use previously learned policies on different, although similar, problems. In the proposed framework states are represented as sets of first order relations, actions in terms of those relations, and policies are learned over such generalized representation. It is shown how this representation can capture large search spaces with a relatively small set of actions and states, and that policies learned over this generalized representation can be directly apply to other problems which can be characterized by the same set of relations.",
         "Introduction": "Robots are becoming part of our every day life. Their full incorporation requires an increased flexibility to learn and adapt from their interaction with their environment. One of the most active research areas in artificial intelligence devoted to learning through interaction with the environment is reinforcement learning "
      }
   },
   {
      "00NalimovHaworthHeinz.grobid.tei.xml": {
         "DOI": "10.3233/icg-2000-23304",
         "Title": "SPACE-EFFICIENT INDEXING OF CHESS ENDGAME TABLES 1",
         "Author": [
            "E Nalimov",
            "C Haworth",
            "E Heinz"
         ],
         "Abstract": "Chess endgame tables should provide efficiently the value and depth of any required position during play. The indexing of an endgame's positions is crucial to meeting this objective. This paper updates Heinz' previous review of approaches to indexing and describes the latest approach by the first and third authors.",
         "Introduction": "The method used to index an endgame positions' values and depths largely determines both the space required and the speed of access during play over the board. It may aim to optimise the one or the other. A variety of approaches have been adopted as the challenges of larger and more complex endgames have been faced."
      }
   },
   {
      "00Newborn.grobid.tei.xml": {
         "DOI": null,
         "Title": "Deep Blue's contribution to AI",
         "Author": [
            "Monty Newborn"
         ],
         "Abstract": "Deep Blue's defeat of World Chess Champion Garry Kasparov in 1997 marked one of the great accomplishments in artificial intelligence during the previous century. It was the result of work by thousands of researchers beginning in the late 1950s and of the great support given to the project by IBM during the final decade of the century. The achievement suggests great progress can be expected in other related AI problems in this current century.",
         "Introduction": null
      }
   },
   {
      "00NikulinaBerdnikov.grobid.tei.xml": {
         "DOI": null,
         "Title": "Chess macros for chess games and puzzles",
         "Author": [
            "Marina Nikulina",
            "Alexander Berdnikov"
         ],
         "Abstract": "The macro package uchess.sty described here generalizes the well known chess macros chess.sty by Piet Tutelaers [1], bdfchess.sty by Frank Hassel [2] and the less known chess.sty by Tomasz Przechlewski ",
         "Introduction": "The well known and available on CTAN chess macros chess.sty (by Piet Tutelaers) and bdfchess.sty (by Frank Hassel) are excellent but do not work well with the Russian language without manual correction of the original macros. Moreover, if the babel package (versions 3.6 and 3.7) is used, neither chess.sty nor bdfchess.sty can recognize the presence of babel and hence cannot support multilanguage chess notation as they should. The other reason to issue a new macro set is that chess.sty and bdfchess.sty only deal with the classical chess game -such things as non-standard figures and non-standard chess boards are not supported."
      }
   },
   {
      "00Nowatzyk.pdf": {
         "DOI": null,
         "Title": "Tuning Program for DT evaluation function",
         "Author": [
            "A Nowatzyk"
         ],
         "Abstract": "The files in this directory constitute the tuning program that was used by Deep Thought to adjust its evaluation function parameters based on a set of some 868 grand-master games. I forgot where these games came from, but we did not type them in. It was last used in the summer of 1988 and it is believed that this program might be of historical interest to some chess programmers. The Deep Thought hardware is probably no longer functional and without the actual Deep Thought program, this code can only show how DT evaluated chess positions, but it can not play any chess.",
         "Introduction": null
      }
   },
   {
      "00Orwant.pdf": {
         "DOI": "10.1147/sj.393.0782",
         "Title": "EGGG: Automated Programming for Game Generation",
         "Author": [
            "J Orwant"
         ],
         "Abstract": null,
         "Introduction": null
      }
   },
   {
      "00Rhyne.pdf": {
         "DOI": "10.1145/514236.514261",
         "Title": "Computer games' influence on scientific and information visualization",
         "Author": [
            "Theresa-Marie Rhyne"
         ],
         "Abstract": null,
         "Introduction": null
      }
   },
   {
      "00SakutaIida a.grobid.tei.xml": {
         "DOI": "10.3233/icg-2000-23403",
         "Title": "Solving Kriegspiel-like Problems: Exploiting a Transposition Table 1 SOLVING KRIEGSPIEL-LIKE PROBLEMS: EXPLOITING A TRANSPOSITION TABLE",
         "Author": [
            "Makoto Sakuta",
            "Hiroyuki Iida"
         ],
         "Abstract": "We recently proposed Uncertainty Paradigm Search (UPS), a novel deterministic approach for solving problems with uncertainty. One of its applications is in Tsuitate-Tsume-Shogi (mating problems in a Kriegspiel-like variant of Shogi). This approach relies on the use of metapositions. A metaposition is a hybrid complex of possible positions that are not distinguishable for the solver. In this contribution, we examine four methods for encoding a metaposition into some value with fewer bits in order to use a transposition table. Each encoding method is tested in a search process, using a benchmark test set of 102 problems. They show us that the efficiency of search by using a transposition table is improved by a factor of eight. The four encoding methods make use of (1) arithmetic sum, (2) exclusive-OR sum, (3) two cyclic redundancy check codes, and (4) a secure hash function. The method of exclusive-OR sum proves not to be acceptably resistant to type-1 errors in this domain; the others are. Though the execution time is roughly comparable among the other three methods, the arithmetic sum is slightly superior in our implementation.",
         "Introduction": "Game-tree search has been the most important part in developing computer programs to play games with perfect information. Each node and edge in a game tree represents a position and a move respectively. When programming a game with imperfect information, a node of a game tree represents a position, too. However, here we have the difficulty of representing uncertainty. Seen from a game-player's point of view, we would like to know precisely which positions are represented by that node and which are not. To deal with this problem we use information sets arising from the uncertainty that characterizes nodes in the search. Recently, we proposed a novel deterministic approach for solving problems with uncertainty, called Uncertainty Paradigm Search (UPS) "
      }
   },
   {
      "00SakutaIida b.grobid.tei.xml": {
         "DOI": null,
         "Title": "Solving Problems under Uncertainty Paradigm: Encoding a Metaposition and Exploiting the Transposition Table",
         "Author": [
            "Makoto Sakuta",
            "Hiroyuki Iida"
         ],
         "Abstract": "We have recently proposed a novel paradigm for solving problems with uncertainty, called Uncertainty Paradigm. Under this paradigm, solving such a problem deterministically is resolved into the plain AND/OR tree search, which we call Uncertainty Paradigm Search. It uses a metaposition as a node of a game tree instead of a position and a metamove instead of a move. We have shown the applicability and justifiability of this paradigm to both a singleagent problem and an adversary-agent problem. The previous implementation of the search under this paradigm was based on a simple depth-first full-width search with iterative deepening, which did not use a transposition table. In this contribution, we have examined several methods for encoding a metaposition into some value with fewer bits. Then, a transposition table using these encoding methods is incorporated into the search. To confirm the effectiveness of the use of a transposition table, we have chosen the domain of Tsuitate-Tsume-Shogi (mating problems of Kriegspiel-like variant of Shogi). The experiments performed with a test set show us that the efficiency of search with a transposition table is turned out to be higher than the case without it at most by a factor of fourteen. As for encoding methods of a metaposition, we have confirmed that the method that simply sums up each code of position in the metaposition is efficient and allowedly collision-resistant in this domain.",
         "Introduction": "The game-tree search has been the most important part in developing a computer program for games with perfect information. Each node and edge in a game tree is called a position and a move respectively. Even in programming a game with imperfect information, a node of a game tree has been anyway a position. In addition, information sets "
      }
   },
   {
      "00SakutaIida c.pdf": {
         "DOI": null,
         "Title": "Solving screen-chess-type problems: Examining the boundary of solvable or unsolvable problems",
         "Author": [
            "MAkoto Sakuta",
            "Hiroyuki Iida"
         ],
         "Abstract": "hg w f i 0j k 0j hl em e g &e Tc p u a d Ba $ Ba df qg Wp on p i gq rj ts Tu Vl gl vm a d ta $r w S &e gr & ex zy ta d{ !| ~} s l j tk Ti 0j p s rj l p k j Ba dw y ¦| ¤ gg a dc p &f ha n w yw s &a g w yr V g &w p &e Tc ga V a T T h V t 6 e e 0 $ ¡ g ¢ ¡ £ X¤ £ $ ¡¥ #¦ $¦ ¢ ¡ ¡¦ v¤ $ $ ¡ 0¤ h ¦ § vÿ ¢ ©",
         "Introduction": null
      }
   },
   {
      "00SakutaIidaYoshimura.grobid.tei.xml": {
         "DOI": null,
         "Title": "Solving Problems under Uncertainty Paradigm",
         "Author": [
            "Makoto Sakuta",
            "Hiroyuki Iida",
            "Jin Yoshimura"
         ],
         "Abstract": "Abstract| This paper proposes a novel paradigm for solving search problems with uncertainty (hereafter Uncertainty Paradigm). A search under this paradigm is denoted as Uncertainty-Paradigm Search (UPS). UPS is a new forward calculation method of true solutions for dynamic games. In UPS, a metaposition instead of a normal position is employed as a node of a game tree as well as a metamove instead of a normal move. A metaposition is a hybrid of possible positions, while a metamove i s a hybrid of possible moves that is used as an arc between a metaposition and its metaposition successor. Deterministic solving of search problems with uncertainty i s t h us resolved into a plain AND/OR tree search for multi-person games as well as for single-agent puzzles. Theoretically, UPS is applicable in solving any puzzles or endgame problems for incomplete-information games. We implemented UPS in a computer program of a c hess-like game with uncertainty, i.e., Kriegspiel-like v ariant of Japanese chess, and Counterfeit-Coin Problem. We then demonstrated the eectiveness of the proposed idea.",
         "Introduction": "We rst claim the problem statement on the solving problems under uncertainty situation, and then discuss the conventional approach for solving problems concerned."
      }
   },
   {
      "00Saremba.grobid.tei.xml": {
         "DOI": null,
         "Title": "The Why and Wherefore",
         "Author": [
            "Andreas Saremba"
         ],
         "Abstract": "The goal of this article is to make a plea for the development and adoption of an XML-based standard format that can facilitate the communication of any kind of chess data: games both commented and uncommented, problems, studies, computer program analysis etc. -simply anything relevant to the game of chess. It discusses the present state of data formats in the world of computers and chess, shows their problems and deficiencies and outlines the way to a better solution.",
         "Introduction": null
      }
   },
   {
      "00Schaeffer.pdf": {
         "DOI": "10.1016/s0065-2458(00)80019-4",
         "Title": "The Games Computers (and People) Play",
         "Author": [
            "Jonathan Schaeffer"
         ],
         "Abstract": null,
         "Introduction": null
      }
   },
   {
      "00SchaefferPlaat.pdf": {
         "DOI": "10.1007/3-540-45486-1_1",
         "Title": "Unifying Single-Agent and Two-Player Search",
         "Author": [
            "Jonathan Schaeffer",
            "Aske Plaat"
         ],
         "Abstract": null,
         "Introduction": null
      }
   },
   {
      "00Sick.pdf": {
         "DOI": null,
         "Title": "Working Draft for ChessML, Version 0.4, Level 0",
         "Author": [
            "Oliver Sick"
         ],
         "Abstract": null,
         "Introduction": null
      }
   },
   {
      "00Spiegel.grobid.tei.xml": {
         "DOI": "10.1007/978-94-015-9608-4_10",
         "Title": "Automatic Distribution in Pangaea",
         "Author": [
            "André Spiegel"
         ],
         "Abstract": "Pangaea is a system that can distribute centralized Java programs, based on static source code analysis and using arbitrary distribution platforms, such as RMI or CORBA, as a backend. Pangaea takes the idea of distribution transparency one logical step further: both the decision for an appropriate distribution strategy for a program, and the realization of that strategy on a particular distribution platform, are accomplished not only transparently, but also automatically. An important benefit of using static source code analysis for automatic distribution is that it can detect optimizations which would be impossible for a purely run-time based approach.",
         "Introduction": "Pangaea 1 is a system that can distribute centralized Java programs automatically. Based on static source code analysis, Pangaea first takes an abstract decision how a given program should be distributed, such that certain requirements and optimization criteria are fulfilled. The distribution strategy thus obtained indicates which objects should be placed onto which node, when and how object migration is to be employed, etc. Pangaea then realizes that strategy by transforming the program's source code for a given distribution platform, trying to make good use of the abilities and features of that platform. Pangaea can therefore be considered a distributing compiler: the source language is pure Java, without any restrictions or added constructs, the target language is the distributed Java variant of the chosen distribution platform."
      }
   },
   {
      "00UiterwijkHerik.grobid.tei.xml": {
         "DOI": "10.1016/s0020-0255(99)00095-x",
         "Title": "The advantage of the initiative",
         "Author": [
            "J Uiterwijk",
            "H Van Den Herik"
         ],
         "Abstract": "Recently, the list of solved two-person zero-sum games with perfect information has increased. The state of current knowledge is that many games are a win for the ®rst player, some games are draws, and only a few games are a win for the second player. For games with three outcomes (won, drawn, lost) a game is commonly de®ned as fair if the theoretical value of the game is drawn. For these games as well as for games with two outcomes (won, lost) we were tempted to examine which concepts characterize the outcome of a game.",
         "Introduction": null
      }
   },
   {
      "00Vicente.grobid.tei.xml": {
         "DOI": "10.1037//0033-295x.107.3.601",
         "Title": "Revisiting the constraint attunement hypothesis: Reply to Ericsson, Patel, and Kintsch (2000) and Simon and Gobet (2000).",
         "Author": [
            "Kim Vicente",
            "Neil Charness",
            "Anders Ericsson",
            "John Flach",
            "Fernand Gobet",
            "David Hull",
            "Elke Kurz",
            "Vernon Mcdonald",
            "Dick Neisser",
            "Henrik Olsson",
            "Vimla Patel",
            "Sverker Runeson",
            "Herbert Simon"
         ],
         "Abstract": "This article is part of an exchange concerning the contributions of the constraint attunement hypothesis (",
         "Introduction": null
      }
   },
   {
      "00Wang.grobid.tei.xml": {
         "DOI": "10.1109/icdm.2015.130",
         "Title": "Parallel Inductive Logic in Data Mining",
         "Author": [
            "Yu Wang"
         ],
         "Abstract": "Data-mining is the process of automatic extraction of novel, useful and understandable patterns from very large databases. High-performance, scalable, and parallel computing algorithms are crucial in data mining as datasets grow i n e x o rably in size and complexity. Inductive logic is a research area in the intersection of machine learning and logic programming, which has been recently applied to data mining. Inductive logic studies learning from examples, within the framework provided by clausal logic. It provides a uniform and very expressive means of representation: All examples, background knowledge as well as the induced theory are expressed in rst-order logic. However, such an expressive representation is often computationally expensive. This report rst presents the background for p a rallel data mining, the BSP model, and inductive logic programming. Based on the study, t h i s report gives an approach to parallel inductive logic in data mining that solves the potential performance problem. Both parallel algorithm and cost analysis are provided. This approach is applied to a number of problems and it shows a super-linear speedup. To justify this analysis, I implemented a parallel version of a c o re ILP system { Progol { in C with the support of the BSP parallel model. Three test cases are provided and a double speedup phenomenon is observed on all these datasets and on two di erent parallel computers.",
         "Introduction": "Basis of this report. This report shows a parallel data-mining algorithm that can be applied to large database mining using inductive logic programming. The central hypothesis of this report is that it is necessary and feasible to adopt parallel algorithms in the data mining process. I show that parallelism can be e ciently applied to inductive logic programming (ILP). The powerful knowledge representation and excellent i n tegration with background knowledge of ILP has shown a great value among data-mining algorithms."
      }
   },
   {
      "00Zazzo.pdf": {
         "DOI": "10.1007/bf02195028",
         "Title": "Alfred Binet",
         "Author": [
            "René Zazzo"
         ],
         "Abstract": "The old science of education is like an old-fashioned carriage: it squeaks but it can still serve a turn [...] [modern educational science] looks like a precision-made machine, but the parts do not hold together and it has one defect: it does not work.' Such is Alfred Binet's conclusion in the final chapter of his last book Modern Ideas about Children. Published in 1911, this is a critical review of what 'thirty years of experimental research [...] have taught us about educational matters'. However, the author does not summarize this research, but suggests new avenues of investigation and so outlines the work to be done in the future. This future did not include him, however, as he died a few months after the book's publication. His review is thus something of a testament.",
         "Introduction": null
      }
   }
]